benchmark.yaml
config:
  plugins:
      expect: {}
  target: 'http://cloudenelx.dev.ctinnovation.it/api'
  phases:
    - duration: 10
      arrivalRate: 100
  defaults:
    headers:
      app_token: 'bb91039efa3c63779e076b1893927c6596cf1d23b82254df101860b4d4e6002b4'
scenarios:
  # - name : "Benchmark authorized"
  #   flow:
  #   - get:
  #       url: "/channels"
  #       expect:
  #           - statusCode: 200
  - name : "Benchmark unAuthorized"
    flow:
    - get:
        url: "/channels"
        expect:
            - statusCode: 401