hello.yml
config:
  plugins:
      expect: {}
  target: 'http://cloudenelx.dev.ctinnovation.it/api'
  phases:
    - duration: 1
      arrivalRate: 1
  defaults:
    headers:
      app_token: 'bb91039efa3c63779e076b1893927c6596cf1d23b82254df101860b4d4e6002b'
scenarios:
  - flow:
    - get:
        url: "/channels"
        expect:
            - statusCode: 200
            - contentType: json    
            - hasProperty: 'data[0].id'