theater-socket.io.yaml
config:
  target: "https://cloudenelx.dev.ctinnovation.it/theaterGeo"
  phases:
    - duration: 1
      arrivalRate: 1
  socketio:
    query:
      app_token: "65553b979f2a36e03430532e63c5680d6061320890cb8515437fc162c2e9548f"
scenarios:
  - engine: "socketio"
    flow:
      # - think: 10 # do nothing for 10m and disconnect
      - emit:
          channel: "echo"
          data: "do not care about the response"
          # acknowledge:
          #     match:
          #       json: "$.1.answer"
          #       value: 42
      - think: 1